In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost

In [3]:
%%sql
USE swiggy_da;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [4]:
%%sql
-- Validate user creation and location assignment
-- Ensures users exist across multiple locations
SELECT
    location_area,
    COUNT(*) AS user_count
FROM users
GROUP BY location_area
ORDER BY user_count DESC;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('East Delhi', 66),
 ('Chennai', 59),
 ('Bangalore', 56),
 ('South Delhi', 55),
 ('Central Delhi', 54),
 ('Hyderabad', 49),
 ('Pune', 47),
 ('North Delhi', 38),
 ('Mumbai', 38),
 ('West Delhi', 38)]

In [5]:
%%sql
-- RESTAURANT & MENU CONSISTENCY
-- Validate that each restaurant has associated menu items
-- Prevents orphan restaurants without menus
SELECT
    r.restaurant_id,
    r.name AS restaurant_name,
    COUNT(m.item_id) AS menu_item_count
FROM restaurants r
LEFT JOIN menu_items m
    ON r.restaurant_id = m.restaurant_id
GROUP BY r.restaurant_id, r.name;

 * mysql+mysqlconnector://root:***@localhost
7 rows affected.

[(1, 'Spicy Hub', 1),
 (2, 'Royal Biryani House', 1),
 (3, 'The Pizza Box', 4),
 (4, 'Wok & Roll', 4),
 (5, 'Sweet Truth', 3),
 (6, 'Dhaba 1986', 4),
 (7, 'Salad Days', 3)]

In [7]:
%%sql
-- ORDER VOLUME & STATUS CHECK
-- Validate distribution of order statuses
-- Confirms realistic order lifecycle simulation
SELECT
    order_status,
    COUNT(*) AS order_count
FROM orders
GROUP BY order_status;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('CONFIRMED', 15), ('DELIVERED', 4065), ('CANCELLED', 935)]

In [9]:
%%sql
-- TEMPORAL DISTRIBUTION OF ORDERS
-- Validate order timestamps across multiple days
-- Ensures suitability for trend and time-series analysis
SELECT
    DATE(order_time) AS order_date,
    COUNT(*) AS orders_per_day
FROM orders
GROUP BY DATE(order_time)
ORDER BY order_date
limit 10;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(datetime.date(2025, 7, 20), 19),
 (datetime.date(2025, 7, 21), 27),
 (datetime.date(2025, 7, 22), 31),
 (datetime.date(2025, 7, 23), 30),
 (datetime.date(2025, 7, 24), 27),
 (datetime.date(2025, 7, 25), 22),
 (datetime.date(2025, 7, 26), 23),
 (datetime.date(2025, 7, 27), 34),
 (datetime.date(2025, 7, 28), 30),
 (datetime.date(2025, 7, 29), 30)]

In [10]:
%%sql
-- ORDER & ORDER ITEMS INTEGRITY
-- Validate that each order contains at least one item
-- Ensures no empty or invalid orders exist
SELECT
    o.order_id,
    COUNT(oi.order_item_id) AS item_count
FROM orders o
LEFT JOIN order_items oi
    ON o.order_id = oi.order_id
GROUP BY o.order_id
HAVING item_count = 0;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [11]:
%%sql
-- FINANCIAL ACCURACY CHECK 
-- Validate that order totals match the sum of item-level prices
-- Confirms pricing and quantity calculations are correct
SELECT
    o.order_id,
    o.total_amount AS stored_total,
    SUM(oi.item_price * oi.quantity) AS calculated_total
FROM orders o
JOIN order_items oi
    ON o.order_id = oi.order_id
GROUP BY o.order_id
HAVING stored_total != calculated_total;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [12]:
%%sql
-- DELIVERY PERFORMANCE VALIDATION
-- Validate delivery records and performance metrics
-- Useful for operational efficiency analysis
SELECT
    delivery_status,
    COUNT(*) AS deliveries,
    AVG(actual_minutes) AS avg_delivery_time
FROM deliveries
GROUP BY delivery_status;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[('DELIVERED', 4080, Decimal('39.8211'))]

In [14]:
%%sql
-- REVIEW DATA VALIDATION
-- Validate customer reviews and rating distribution
-- Ensures reviews exist only for completed deliveries
SELECT
    rating,
    COUNT(*) AS review_count
FROM reviews
GROUP BY rating
ORDER BY rating DESC;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(5, 924), (4, 1360), (3, 1003), (2, 557), (1, 222)]

In [15]:
%%sql
-- END-TO-END RELATIONAL CHECK
-- End-to-end relational validation
-- Confirms full linkage: user → order → restaurant → items → location
SELECT
    u.user_id,
    u.location_area,
    r.name AS restaurant_name,
    o.order_id,
    o.total_amount,
    o.order_status
FROM orders o
JOIN users u
    ON o.user_id = u.user_id
JOIN restaurants r
    ON o.restaurant_id = r.restaurant_id
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(1, 'North Delhi', 'Spicy Hub', 10, 470, 'CONFIRMED'),
 (1, 'North Delhi', 'Spicy Hub', 18, 250, 'CONFIRMED'),
 (1, 'North Delhi', 'Spicy Hub', 19, 1500, 'CONFIRMED'),
 (1, 'North Delhi', 'Spicy Hub', 20, 2790, 'CONFIRMED'),
 (1, 'North Delhi', 'Spicy Hub', 24, 1100, 'CONFIRMED'),
 (21, 'Hyderabad', 'Spicy Hub', 32, 660, 'DELIVERED'),
 (260, 'North Delhi', 'Spicy Hub', 34, 220, 'DELIVERED'),
 (224, 'Chennai', 'Spicy Hub', 37, 660, 'DELIVERED'),
 (129, 'Chennai', 'Spicy Hub', 45, 660, 'CANCELLED'),
 (259, 'Bangalore', 'Spicy Hub', 50, 220, 'DELIVERED')]

Summary – Data Validation & Integrity Checks

* This notebook focused on validating the quality, consistency, and reliability of the dataset before performing any business analysis. Since analytical results are only as trustworthy as the underlying data, this stage was critical to ensure that all records adhere to the defined schema and business rules.

* User data was first validated to confirm that user identifiers exist consistently across tables and that location information is present and usable for geographic analysis. This ensures that user-level and location-based insights can be derived without ambiguity.

* Restaurant and menu data were then examined to verify correct mappings between restaurants and their menu items. These checks ensured that each restaurant has its own distinct menu and that no menu items are incorrectly associated with the wrong restaurant, preserving analytical accuracy at the restaurant level.

* Order data was validated to confirm realistic order volumes, valid order statuses, and proper timestamp distribution across multiple days. This establishes the suitability of the dataset for time-based and trend analysis.

* At the transactional level, the relationship between orders and order items was thoroughly checked. Every order was verified to contain valid line items, and financial validation confirmed that stored order totals accurately reflect the sum of item prices and quantities. This step is essential for revenue and pricing analysis.

* Delivery records were analyzed to ensure that each order has a corresponding delivery entry with meaningful performance metrics. This enables operational analysis such as delivery efficiency and service-level performance.

* Customer reviews were validated to confirm proper linkage to completed orders and the presence of usable rating data. This ensures that customer satisfaction analysis is grounded in valid transactional outcomes.

* Finally, end-to-end relational checks confirmed seamless connectivity across users, orders, restaurants, order items, deliveries, and reviews. These checks collectively verified that the entire data pipeline is internally consistent and free from structural anomalies.

With all validation checks successfully completed, the dataset is confirmed to be accurate, coherent, and fully prepared for downstream SQL-based business analysis.